In [10]:
import pandas as pd
import numpy as np

In [2]:
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.values # values값만 numpyarray로 반환
obj.index # index꼴로 반환

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = pd.Series([4,7,-5,3], index=['d','b','a','c']) #인덱스를 직접 지정해줌
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [7]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [8]:
obj2[obj2>0] # 0보다 큰 값 반환함

d    4
b    7
c    3
dtype: int64

In [9]:
obj2 * 2 #모든 값 2배

d     8
b    14
a   -10
c     6
dtype: int64

In [11]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [12]:
np.cos(obj2)

d   -0.653644
b    0.753902
a    0.283662
c   -0.989992
dtype: float64

In [14]:
sdata = {'Ohio':35000, 'Texas':71000, 'Oregon':16000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
dtype: int64

In [19]:
states=['California', 'Ohio', 'Oregon', 'Texas']
newData = pd.Series(sdata, index=states)
# newData['California'] = 30000
# newData
newData

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [22]:
pd.isnull(newData).sum() # null 값이냐 체크

1

In [24]:
pd.notnull(newData).mean() # %값

0.75

In [27]:
# print(obj3, newData)
obj3+newData #값을 더하고 하나라도 없으면 NaN처리한다

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
dtype: float64

In [28]:
newData.name = 'Population' #표(객체)의 이름 지정
newData.index.name='state'# index의 이름 지정
newData

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: Population, dtype: float64

In [31]:
obj
obj.index = ['Bob','Steve','Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [34]:
obj['Ryan'] == obj[3]

True

In [42]:
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
       'year':[2000,2001,2002,2001,2002,2003],
       'pop':[1.5,1.7,3.6,2.4,2.9,3.2]
       }
frame = pd.DataFrame(data,columns=['year','pop','state'])#columns지정으로 순서 변경 가능
frame

   year  pop   state
0  2000  1.5    Ohio
1  2001  1.7    Ohio
2  2002  3.6    Ohio
3  2001  2.4  Nevada
4  2002  2.9  Nevada
5  2003  3.2  Nevada

In [40]:
frame.head(1) # 내부에 숫자를 넣으면 그만큼 나옴, default는 5개

  state  year  pop
0  Ohio  2000  1.5

In [46]:
frame2 = pd.DataFrame(data,index=['one','two','three','four','five','six'], columns =['year','state','pop','debt'])

In [47]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [48]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [51]:
frame2.year
frame2['year'] #두개의 출력이 같다

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [53]:
frame2.loc['three'] #index중 three의 행을 가져옴

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [55]:
frame2['debt'] = 16.5 #모든 debt에 16.5대입함
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [66]:
frame2['temp']= np.arange(28,34) #6까지 소수형으로 대입한다.
frame2

       year   state  pop  debt  temp
one    2000    Ohio  1.5   0.0    28
two    2001    Ohio  1.7   1.0    29
three  2002    Ohio  3.6   2.0    30
four   2001  Nevada  2.4   3.0    31
five   2002  Nevada  2.9   4.0    32
six    2003  Nevada  3.2   5.0    33

In [68]:
# del frame2['dabt']#dabt삭제
frame2

       year   state  pop  debt  temp
one    2000    Ohio  1.5   0.0    28
two    2001    Ohio  1.7   1.0    29
three  2002    Ohio  3.6   2.0    30
four   2001  Nevada  2.4   3.0    31
five   2002  Nevada  2.9   4.0    32
six    2003  Nevada  3.2   5.0    33

In [70]:
val = pd.Series([-1.2, -1.5, -1.7], index = ['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt  temp
one    2000    Ohio  1.5   NaN    28
two    2001    Ohio  1.7  -1.2    29
three  2002    Ohio  3.6   NaN    30
four   2001  Nevada  2.4  -1.5    31
five   2002  Nevada  2.9  -1.7    32
six    2003  Nevada  3.2   NaN    33

In [73]:
frame2['eastern'] = frame2.state=='Ohio' # 만약 State가 Ohio면 True 아님 False 
frame2

       year   state  pop  debt  temp  eastern
one    2000    Ohio  1.5   NaN    28     True
two    2001    Ohio  1.7  -1.2    29     True
three  2002    Ohio  3.6   NaN    30     True
four   2001  Nevada  2.4  -1.5    31    False
five   2002  Nevada  2.9  -1.7    32    False
six    2003  Nevada  3.2   NaN    33    False

In [74]:
del frame2['eastern']
frame2

       year   state  pop  debt  temp
one    2000    Ohio  1.5   NaN    28
two    2001    Ohio  1.7  -1.2    29
three  2002    Ohio  3.6   NaN    30
four   2001  Nevada  2.4  -1.5    31
five   2002  Nevada  2.9  -1.7    32
six    2003  Nevada  3.2   NaN    33

In [84]:
pop = {
    'Nevada':{2001:2.4, 2002:2.9},
    'Ohio':{2000:1.5, 2001:1.7, 2002:3.6},
}
frame3 = pd.DataFrame(pop)
# frame3.Nevada[2000] = 3.3
frame3.T # 행과 열을 바꾸어준다

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [86]:
pd.DataFrame(pop, index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [91]:
pdata ={'Ohio':frame3['Ohio'][:-1],
       'Nevada':frame3['Nevada'][:2]
       } # Series객체를 담고 있는 사전데이터도 같은방식으로 취급가능하다
pd.DataFrame(pdata)
pdata

{'Ohio': year
 2001    1.7
 2002    3.6
 Name: Ohio, dtype: float64,
 'Nevada': year
 2001    2.4
 2002    2.9
 Name: Nevada, dtype: float64}

In [88]:
frame3.index.name = 'year'; frame3.columns.name='state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [92]:
obj = pd.Series(range(3), index=['a','b','c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [95]:
index[1] = 'd' #index는 변경이 불가능 (dict의 key처럼 변경 불가)
#pandas 인덱스는 중복이 가능하다
#만약 인덱스로 검사시 둘다 나온다

TypeError: Index does not support mutable operations

In [96]:
obj = pd.Series([4.5,7.2,-5.3,3.6], index=['d','b','a','c']) 
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [97]:
obj2 = obj.reindex(['a','b','c','d','e'])#재배열 없는건 NaN
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [101]:
obj3 = pd.Series(['blue','purple','yellow'],index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [100]:
obj3.reindex(range(6), method='ffill') # method ffill은 없는인덱스를 Nan으로 두지않고 앞에것으로 채워준다

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [102]:
obj3.reindex(range(6), method='bfill') #method bfill은 없는인덱스를 Nan으로 두지않고 뒤에것으로 채워준다

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [103]:
obj3.reindex(range(6),fill_value = 0) # 없는 value는 0으로 채워준다

0      blue
1         0
2    purple
3         0
4    yellow
5         0
dtype: object

In [107]:
obj = pd.Series(np.arange(5.), index=['a','b','c','d','e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [109]:
obj.drop('a') #a행 drop

b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [110]:
data = pd.DataFrame(np.arange(16).reshape((4,4)), index = ['Ohio','Colorado','Utah','New York'],
                   columns = ['one','two','three','four']
                   )
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [111]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [115]:
data.drop('two', axis=1) #two 드랍
data.drop('two', axis='columns') # 위에랑 값이 같다

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [116]:
obj.drop('c', inplace=True) #복사본이 아닌 원본에 저장됨

In [122]:
# Series 는 열이 하나밖에 안됨 여러개 처리하려면 DataFrame사용
obj[obj<2]
obj[0:2]
obj['b':'d'] #정수 index로 가져오면 python규칙 그대로 가져오지만 이름으로 slicing하면 둘다 포함해서 가져온다

b    1.0
d    3.0
dtype: float64

In [132]:
data[:2]
data[data['three']> 5]
data.loc['Colorado']  #index로 검색

one      4
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [133]:
data.iloc[2,[3,0,1]] #정수로 색인하려면 iloc

four    11
one      8
two      9
Name: Utah, dtype: int32

In [134]:
data.loc[:'Utah','two'] # 앞에꺼는 index 뒤에꺼는 column

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int32

In [136]:
data.iloc[:,:3]#순서대로 행 열 가져와서 출력

          one  two
Ohio        0    1
Colorado    4    5
Utah        8    9
New York   12   13

In [139]:
#loc 사용 [행이름, 열이름]
#iloc사용 [숫자,숫자]
data.iloc[:,:3][data.three>5] #행은 전체 열은 2까지 조건은 three가 5이상인것

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14